//app.js
App({
  globalData: {
    userOpenid:null,
    userInfo: {},
    kindList: [
      {
        imgPath: "../../images/kehuishouwu.png",
        color: "#215287",
        text: "可回收物",
        description: "可回收物就是再生资源，指生活垃圾中未经污染、适宜回收循环利用的废物，主要包括废弃电器电子产品、废纸张、废塑料、废玻璃、废金属等五类，是现阶段生活垃圾分类的主要工作和影响垃圾减量的重要因素。",
        desc: ['纸板箱', '报纸', '书本', '快递纸袋', '打印纸', '信封', '广告单', '利乐包', '饮料瓶', '洗发水瓶', '乳液罐', '食用油桶', '塑料碗盆', '塑料盒', '塑料玩具', '塑料衣架', 'PE塑料', 'PVC塑料', '亚克力板', '塑料卡片', 'KT板', '泡沫塑料', '帆布袋', '调料瓶', '酒瓶', '化妆品瓶', '玻璃杯', '窗玻璃', '放大镜', '碎玻璃', '小型木制品', '易拉罐', '食品罐桶', '菜刀', '锅', '刀片', '指甲钳', '螺丝刀', '铁钉', '铁皮', '铅箔', '旧衣服', '床单', '枕头', '棉被', '皮鞋', '毛绒玩具', '棉袄', '包', '皮带', '丝绸制品', '电路板', '充电宝/U盘', '电线', '家电'],
        dispose: [
          "尽量保持清洁干燥，避免污染",
          "立体包装物请清空内容物，清洁后压扁投放",
          "废纸应保持平整",
          "废玻璃制品及带尖锐角物品，应包裹后投放"
        ]
      },
      {
        imgPath: "../../images/youhailaji.png",
        color: "#EA3E30",
        text: "有害垃圾",
        description: "有害垃圾，指生活垃圾中对人体健康或自然环境造成直接或潜在危害的物质，必须单独收集、运输、存贮，由环保部门认可的专业机构进行特殊安全处理。",
        desc: ['充电电池', '镉镍电池', '铅酸电池', '蓄电池', '纽扣电池', '荧光灯管', '日光灯管', '卤素灯', '药品', '药品内包装', '油漆桶', '染发剂壳', '指甲油', '洗甲水', '矿物油及包装', '含水银温度计', '含水银血压计', '老鼠药', '杀虫喷雾罐', '消毒剂', 'X光片', '相片底片'],
        dispose: [
          "杀虫剂等压力罐装容器，应排空内容物后投放",
          "投放时请注意轻放",
          "易破损的请连带包装或包裹后轻放",
          "如易挥发，请密封后投放",
        ]
      },
      {
        imgPath: "../../images/shilaji.png",
        color: "#62423A",
        text: "湿垃圾",
        description: "湿垃圾又称为厨余垃圾，即易腐垃圾，指食材废料、剩菜剩饭、过期食品、瓜皮果核、花卉绿植、中药药渣等易腐的生物质生活废弃物。",
        desc: ['五谷杂粮', '米面豆制品', '肉', '内脏', '蛋', '蛋壳', '鱼', '鱼骨', '虾', '虾壳', '鱿鱼', '蔬菜', '菌菇', '调料/酱料', '小骨/碎骨', '茶叶渣', '咖啡渣', '糕饼', '糖果', '肉干', '香菇干', '宠物饲料', '果肉', '软果皮', '软果籽', '家养绿植', '中药材', '中药药渣'],
        dispose: [
          "纯流质的食物垃圾，如牛奶等，应直接倒入下水口",
          "有包装的湿垃圾应将包装物去除后分类投放，包装物请投放对应的垃圾容器"
        ]
      },
      {
        imgPath: "../../images/ganlaji.png",
        color: "#2E2C2A",
        text: "干垃圾",
        description: "干垃圾（其它垃圾）指除可回收物、有害垃圾、餐厨垃圾外的其他生活垃圾，即现环卫体系主要收集和处理的垃圾。",
        desc: ['大骨头', '硬贝壳', '椰子壳', '榴莲壳', '核桃壳', '玉米衣', '甘蔗皮', '粽叶', '榴莲核', '菠萝蜜核', '餐巾纸', '卫生间用纸', '一次性纸杯', '一次性餐具', '一次性手套', '零食包装袋', '尿不湿', '湿纸巾', '卫生纸', '面膜', '眼影', '口红', '粉底液', '睫毛膏', '防晒霜', '护肤霜', '卸妆棉', '卸妆油', '棉签', '粉扑', '假睫毛', '隐形眼镜', '污损塑料袋', '毛巾', '丝袜', '内衣', '污损纸张', '玻璃钢', '猫砂', '狗屎垫', '干燥剂', '烟蒂', '编织袋', '尼龙制品', '毛发', '防碎气泡膜', '炉渣', '灰土', '胶带', '橡皮泥', '竹制品', '陶瓷碗盆', '打火机', '镜子', '伞', '笔'],
        dispose: [
          "尽量沥干水分",
          "难以辨识类别的垃圾投入干垃圾容器内"
        ]
      },
    ]
  },

  onLaunch: function () {
    if (!wx.cloud) {
      console.error('请使用 2.2.3 或以上的基础库以使用云能力')
    } else {
      wx.cloud.init({
        env: 'wechatminiprogram-l4n3y',
        traceUser: true,
      })
    }
  }
})
